Revit 2027 API
IDuctFittingAndAccessoryPressureDropServer.IsApplicable Method
 Check if the server is applicable for the duct fitting or duct accessory.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
bool IsApplicable(
	DuctFittingAndAccessoryPressureDropData data
)
Function IsApplicable (
	data As DuctFittingAndAccessoryPressureDropData
) As Boolean
bool IsApplicable(
	DuctFittingAndAccessoryPressureDropData^ data
)
abstract IsApplicable :
        data : DuctFittingAndAccessoryPressureDropData -> bool
Parameters
data DuctFittingAndAccessoryPressureDropData
 The input data of the calculation.
Return Value
Boolean
See Also
Reference
IDuctFittingAndAccessoryPressureDropServer Interface
Autodesk.Revit.DB.Mechanical Namespace